In [ ]:
import pandas as pd
import numpy as np
import tensorflow as tf
import matplotlib.pyplot as plt
%matplotlib inline

In [ ]:
from google.colab import drive

In [ ]:
drive.mount('/content/gdrive')

Drive already mounted at /content/gdrive; to attempt to forcibly remount, call drive.mount("/content/gdrive", force_remount=True).

In [ ]:
df=pd.read_csv('/content/gdrive/My Drive/Churn_Modelling.csv')

In [ ]:
df.head()

   RowNumber  CustomerId   Surname  ...  IsActiveMember EstimatedSalary Exited
0          1    15634602  Hargrave  ...               1       101348.88      1
1          2    15647311      Hill  ...               1       112542.58      0
2          3    15619304      Onio  ...               0       113931.57      1
3          4    15701354      Boni  ...               0        93826.63      0
4          5    15737888  Mitchell  ...               1        79084.10      0

[5 rows x 14 columns]

In [ ]:
df.drop(['RowNumber'],axis=1,inplace=True)

In [ ]:
df.head()

   CustomerId   Surname  CreditScore  ... IsActiveMember EstimatedSalary  Exited
0    15634602  Hargrave          619  ...              1       101348.88       1
1    15647311      Hill          608  ...              1       112542.58       0
2    15619304      Onio          502  ...              0       113931.57       1
3    15701354      Boni          699  ...              0        93826.63       0
4    15737888  Mitchell          850  ...              1        79084.10       0

[5 rows x 13 columns]

In [ ]:
pd.unique(df.Geography)

array(['France', 'Spain', 'Germany'], dtype=object)

In [ ]:
df.drop(['Surname'],axis=1,inplace=True)

In [ ]:
df.drop(['CustomerId'],axis=1,inplace=True)

In [ ]:
df.head()

   CreditScore Geography  Gender  ...  IsActiveMember  EstimatedSalary  Exited
0          619    France  Female  ...               1        101348.88       1
1          608     Spain  Female  ...               1        112542.58       0
2          502    France  Female  ...               0        113931.57       1
3          699    France  Female  ...               0         93826.63       0
4          850     Spain  Female  ...               1         79084.10       0

[5 rows x 11 columns]

In [ ]:
print(df.columns.values.tolist())

['CreditScore', 'Geography', 'Gender', 'Age', 'Tenure', 'Balance', 'NumOfProducts', 'HasCrCard', 'IsActiveMember', 'EstimatedSalary', 'Exited']

In [ ]:
x=df[['CreditScore', 'Geography', 'Gender', 'Age', 'Tenure', 'Balance', 'NumOfProducts', 'HasCrCard', 'IsActiveMember', 'EstimatedSalary']]
y=df['Exited']

In [ ]:
x.head()

   CreditScore Geography  Gender  ...  HasCrCard  IsActiveMember  EstimatedSalary
0          619    France  Female  ...          1               1        101348.88
1          608     Spain  Female  ...          0               1        112542.58
2          502    France  Female  ...          1               0        113931.57
3          699    France  Female  ...          0               0         93826.63
4          850     Spain  Female  ...          1               1         79084.10

[5 rows x 10 columns]

In [ ]:
from sklearn.preprocessing import LabelEncoder

In [ ]:
le2=LabelEncoder()
x['Gender']=le2.fit_transform(x['Gender'])

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [ ]:
x.head()

   CreditScore Geography  Gender  ...  HasCrCard  IsActiveMember  EstimatedSalary
0          619    France       0  ...          1               1        101348.88
1          608     Spain       0  ...          0               1        112542.58
2          502    France       0  ...          1               0        113931.57
3          699    France       0  ...          0               0         93826.63
4          850     Spain       0  ...          1               1         79084.10

[5 rows x 10 columns]

In [ ]:
x=pd.concat([x,pd.get_dummies(x['Geography'])],axis=1)

In [ ]:
x.drop(['Geography'],axis=1,inplace=True)

In [ ]:
x.head()

   CreditScore  Gender  Age  Tenure  ...  EstimatedSalary  France  Germany  Spain
0          619       0   42       2  ...        101348.88       1        0      0
1          608       0   41       1  ...        112542.58       0        0      1
2          502       0   42       8  ...        113931.57       1        0      0
3          699       0   39       1  ...         93826.63       1        0      0
4          850       0   43       2  ...         79084.10       0        0      1

[5 rows x 12 columns]

In [ ]:
from sklearn.preprocessing import StandardScaler

In [ ]:
from sklearn.model_selection import train_test_split

In [ ]:
x_train,x_test,y_train,y_test=train_test_split(x,y)

In [ ]:
x_train=StandardScaler().fit_transform(x_train.values)

In [ ]:
x_test=StandardScaler().fit_transform(x_test)

In [ ]:
x_train[0:5]

array([[ 0.26535189,  0.92742603, -1.52087125, -1.38504401,  0.50357887,
        -0.91128237, -1.55262397,  0.97445939,  0.27885753,  0.99335541,
        -0.57632387, -0.57324462],
       [ 0.41984102,  0.92742603, -0.47057218,  1.03185457,  0.92373774,
         0.80898387,  0.64407095, -1.02621003, -0.15619826,  0.99335541,
        -0.57632387, -0.57324462],
       [-1.33103572,  0.92742603,  0.19779996,  1.03185457,  0.70923612,
        -0.91128237, -1.55262397,  0.97445939, -1.38853267, -1.00668904,
         1.7351355 , -0.57324462],
       [-0.09512273,  0.92742603, -0.75701738, -0.69450156,  1.2351399 ,
        -0.91128237,  0.64407095, -1.02621003, -0.70276566, -1.00668904,
        -0.57632387,  1.74445599],
       [ 0.47133739,  0.92742603, -0.94798084,  1.03185457, -1.22836524,
         0.80898387,  0.64407095, -1.02621003,  1.57933297,  0.99335541,
        -0.57632387, -0.57324462]])

In [ ]:
model=tf.keras.models.Sequential()

In [ ]:
model.add(tf.keras.layers.Dense(x_train.shape[1],activation='relu'))
model.add(tf.keras.layers.Dense(128,activation='relu'))
model.add(tf.keras.layers.Dense(64,activation='relu'))
model.add(tf.keras.layers.Dense(1,activation='sigmoid'))

In [ ]:
model.compile(optimizer='adam',loss='binary_crossentropy',metrics=['accuracy'])

In [ ]:
model.fit(x_train,y_train.values,batch_size=10,epochs=10)

Epoch 1/10
750/750 [==============================] - 1s 2ms/step - loss: 0.4603 - accuracy: 0.8024
Epoch 2/10
750/750 [==============================] - 1s 2ms/step - loss: 0.4025 - accuracy: 0.8308
Epoch 3/10
750/750 [==============================] - 1s 2ms/step - loss: 0.3737 - accuracy: 0.8444
Epoch 4/10
750/750 [==============================] - 1s 1ms/step - loss: 0.3624 - accuracy: 0.8496
Epoch 5/10
750/750 [==============================] - 1s 2ms/step - loss: 0.3522 - accuracy: 0.8535
Epoch 6/10
750/750 [==============================] - 1s 1ms/step - loss: 0.3495 - accuracy: 0.8553
Epoch 7/10
750/750 [==============================] - 1s 1ms/step - loss: 0.3420 - accuracy: 0.8596
Epoch 8/10
750/750 [==============================] - 1s 1ms/step - loss: 0.3393 - accuracy: 0.8576
Epoch 9/10
750/750 [==============================] - 1s 2ms/step - loss: 0.3370 - accuracy: 0.8600
Epoch 10/10
750/750 [==============================] - 1s 1ms/step - loss: 0.3332 - accuracy: 0.8617

In [ ]:
model.evaluate(x_test,y_test.values,batch_size=10)

250/250 [==============================] - 0s 1ms/step - loss: 0.3391 - accuracy: 0.8608

[0.3390983045101166, 0.86080002784729]